In [1]:
import pandas as pd
from sqlalchemy import create_engine

## Convert File to CSV

## Convert the CSV to Dataframe

In [3]:
csv_file = "../Resources/customer_data.csv"
total_game_data_df = pd.read_csv(csv_file)
total_game_data_df.head()

   id first_name last_name                       email  gender            car
0   1    Benetta   Cancott   bcancott0@studiopress.com  Female          Scion
1   2     Lilyan    Cherry  lcherry1@deliciousdays.com  Female       Chrysler
2   3    Ezekiel   Benasik         ebenasik2@wikia.com    Male  Mercedes-Benz
3   4    Kennedy     Atlay        katlay3@so-net.ne.jp    Male          Buick
4   5    Sanford    Salmen        ssalmen4@reuters.com    Male        Lincoln

## Create the dataframe with desired columns

In [4]:
game_data_df = total_game_data_df[['id', 'first_name', 'last_name']].copy()
game_data_df.head()

   id first_name last_name
0   1    Benetta   Cancott
1   2     Lilyan    Cherry
2   3    Ezekiel   Benasik
3   4    Kennedy     Atlay
4   5    Sanford    Salmen